app/controllers/pivots_controller.rb

SELECT * FROM `pivots`
---
  def index
    @pivots = Pivot.all

SELECT * FROM `pivots` WHERE (`pivots`.`id` = 1)
---
  def show
    @pivot = Pivot.find(params[:id])

SELECT * FROM `pivots` WHERE (`pivots`.`id` = 1)
---
  def edit
    @pivot = Pivot.find(params[:id])

INSERT INTO `pivots` (`image_url`, `created_at`, `updated_at`, `description`, `like`) VALUES('fn.jpg', '2013-06-07 05:31:54', '2013-06-07 05:31:54', 'happy birthday', 1)
---
  def create
    @pivot = Pivot.new(params[:pivot])

    respond_to do |format|
      if @pivot.save

SELECT * FROM `pivots` WHERE (`pivots`.`id` = 2)
UPDATE `pivots` SET `image_url` = 'jagan.jpg', `description` = 'sdc', `updated_at` = '2013-06-10 09:14:49' WHERE `id` = 1
---
  def update
    @pivot = Pivot.find(params[:id])

    respond_to do |format|
      if @pivot.update_attributes(params[:pivot])

SELECT * FROM `pivots` WHERE (`pivots`.`id` = 1)
DELETE FROM `pivots` WHERE `id` = 1
---
  def destroy
    @pivot = Pivot.find(params[:id])
    @pivot.destroy